#include "arac.h"
#define WAIT 1000
static int WINDOW_WIDTH=1350,WINDOW_HEIGHT=690;

//////////////////////////////
const int arac_sayisi=320;

float arac_dizisi[arac_sayisi][8]={//solX,solY,arc_tip,hýz,yon,yol_id,serit_id,hc_id
	//////YOL1------------------------------------------>9 tane
	//serit0
	{4*3.75,83*3.75,0,1,1,1,0,3},//otomobil	
	{10*3.75,83*3.75,0,1,1,1,0,6},//otomobil
	{22*3.75,83*3.75,0,1,1,1,0,12},//otomobil
	{36*3.75,79*3.75,4,1,4,1,0,22},//kamyonet
	{36*3.75,65*3.75,4,1,4,1,0,29},//kamyonet
	//serit1
	{20*3.75,85*3.75,2,1,2,1,1,10},//kamyon
	{26*3.75,85*3.75,2,1,2,1,1,13},//kamyon
	{36*3.75,85*3.75,4,1,2,1,1,18},//kamyonet
	{38*3.75,61*3.75,4,1,3,1,1,30},//kamyonet
	//YOL2
	//serit0------------------------------------------->14tane
	//solX,solY,arc_tip,hýz,yon,yol_id,serit_id,hc_id
	{4*3.75,4*3.75,4,1,1,2,0,3},//kamyonet
	{12*3.75,4*3.75,0,1,1,2,0,7},//otomobil	
	{20*3.75,4*3.75,4,1,1,2,0,11},//kamyonet
	{30*3.75,4*3.75,4,1,1,2,0,16},//kamyonet
	{46*3.75,4*3.75,4,1,1,2,0,24},//kamyonet
	{54*3.75,4*3.75,2,1,1,2,0,28},//kamyon
	{62*3.75,4*3.75,0,1,1,2,0,32},//otomobil
	
	{96*3.75,4*3.75,4,1,1,2,0,49},//kamyonet
	{106*3.75,4*3.75,4,1,1,2,0,54},//kamyonet
	{120*3.75,4*3.75,2,1,1,2,0,61},//kamyon
	{132*3.75,4*3.75,4,1,1,2,0,67},//kamyonet
	//serit1----------------------------------------------->12 tane
	//solX,solY,arc_tip,hýz,yon,yol_id,serit_id,hc_id
	{2*3.75,6*3.75,4,1,2,2,1,1},//kamyonet
	{4*3.75,6*3.75,0,1,2,2,1,2},//otomobil	
	
	{14*3.75,6*3.75,4,1,2,2,1,7},//kamyonet
	
	{44*3.75,6*3.75,0,1,2,2,1,22},//otomobil	
	
	{106*3.75,6*3.75,4,1,2,2,1,53},//kamyonet
		
	{128*3.75,6*3.75,0,1,2,2,1,64},//otomobil	
	
	{136*3.75,6*3.75,4,1,2,2,1,68},//kamyonet
	
	//YOL3------------------------------------------------->7 tane
	//serit0
	//solX,solY,arc_tip,hýz,yon,yol_id,serit_id,hc_id
	{36*3.75,44*3.75,4,1,4,3,1,19},//kamyonet
	
	{36*3.75,24*3.75,0,1,4,3,1,9},//otomobil
	{36*3.75,14*3.75,0,1,4,3,1,4},//otomobil
	//serit1
	{38*3.75,40*3.75,4,1,3,3,0,18},//kamyonet
	{38*3.75,24*3.75,2,1,3,3,0,10},//kamyon
	{38*3.75,14*3.75,0,1,3,3,0,5},//otomobil
	
	//YOL5-------------------------------------->14 tane
	//serit0---->yon4
	{95*3.75,91*3.75,4,1,4,5,0,1},//kamyonet
	{95*3.75,75*3.75,4,1,4,5,0,9},//kamyonet
	{95*3.75,65*3.75,0,1,4,5,0,14},//otomobil
	{95*3.75,57*3.75,4,1,4,5,0,18},//kamyonet
	{95*3.75,42*3.75,4,1,4,5,0,25},//kamyonet
	{95*3.75,34*3.75,4,1,4,5,0,29},//kamyonet
	{95*3.75,26*3.75,0,1,4,5,0,33},//otomobil
	{95*3.75,18*3.75,4,1,4,5,0,37},//kamyonet
	
	//serit1------------>yon3
	{97*3.75,87*3.75,4,1,3,5,1,2},//kamyonet
	{97*3.75,75*3.75,2,1,3,5,1,8},//kamyon
	{97*3.75,65*3.75,0,1,3,5,1,13},//otomobil
	{97*3.75,53*3.75,0,1,3,5,1,19},//otomobil
	{97*3.75,34*3.75,2,1,3,5,1,28},//kamyon
	{97*3.75,26*3.75,0,1,3,5,1,32},//otomobil
	{97*3.75,10*3.75,0,1,3,5,1,40},//otomobil
	
	


	//YOL7------------------------------------>31 tane
	//serit 2
	{4*3.75,51*3.75,0,1,2,7,2,2},//otomobil
	{10*3.75,51*3.75,0,1,2,7,2,5},//otomobil	
	{22*3.75,51*3.75,4,1,2,7,2,11},//kamyonet
	{42*3.75,51*3.75,0,1,2,7,2,21},//otomobil	
	{60*3.75,51*3.75,0,1,2,7,2,30},//otomobil	
	{74*3.75,51*3.75,0,1,2,7,2,37},//otomobil		
	{84*3.75,51*3.75,4,1,2,7,2,42},//kamyonet
	{88*3.75,51*3.75,0,1,2,7,2,44},//otomobil	
	{100*3.75,51*3.75,0,1,2,7,2,50},//otomobil
	{112*3.75,51*3.75,0,1,2,7,2,56},//otomobil	
	{122*3.75,51*3.75,0,1,2,7,2,61},//otomobil	
	{132*3.75,51*3.75,0,1,2,7,2,66},//otomobil	
	{152*3.75,51*3.75,0,1,2,7,2,76},//otomobil	
	{160*3.75,51*3.75,0,1,2,7,2,80},//otomobil	
	{168*3.75,51*3.75,4,1,2,7,2,84},//kamyonet
	{176*3.75,51*3.75,0,1,2,7,2,88},//otomobil

	//serit1
	{172*3.75,52*3.75,0,1,2,7,1,86},//otomobil	
	{164*3.75,52*3.75,0,1,2,7,1,82},//otomobil
	{156*3.75,52*3.75,0,1,2,7,1,78},//otomobil
	{144*3.75,52*3.75,0,1,2,7,1,72},//otomobil	
	{148*3.75,52*3.75,4,1,2,7,1,74},//kamyonet
	{126*3.75,52*3.75,0,1,2,7,1,63},//otomobil
	{116*3.75,52*3.75,4,1,2,7,1,58},//kamyonet
	{106*3.75,52*3.75,2,1,2,7,1,53},//kamyon
	{94*3.75,52*3.75,0,1,2,7,1,47},//otomobil
	{68*3.75,52*3.75,0,1,2,7,1,34},//otomobil
	{48*3.75,52*3.75,2,1,2,7,1,24},//kamyon
	{54*3.75,52*3.75,4,1,2,7,1,27},//kamyonet
	{30*3.75,52*3.75,0,1,2,7,1,15},//otomobil	
	{38*3.75,52*3.75,0,1,2,7,1,19},//otomobil
	{16*3.75,52*3.75,2,1,2,7,1,8},//kamyon	

	////YOL8----------------------------------------------->69tane
	//serit2
	//solX,solY,arc_tip,hýz,yon,yol_id,serit_id,hc_id
	{2*3.75,48*3.75,0,1,1,8,2,2},//otomobil
	{8*3.75,48*3.75,0,1,1,8,2,5},//otomobil	
	{14*3.75,48*3.75,0,1,1,8,2,8},//otomobil	
	{20*3.75,48*3.75,4,1,1,8,2,11},//kamyonet
	{28*3.75,48*3.75,0,1,1,8,2,15},//otomobil	
	{36*3.75,48*3.75,0,1,1,8,2,19},//otomobil
	{40*3.75,48*3.75,0,1,1,8,2,21},//otomobil	
	{46*3.75,48*3.75,0,1,1,8,2,24},//otomobil	
	{52*3.75,48*3.75,4,1,1,8,2,27},//kamyonet
	{58*3.75,48*3.75,0,1,1,8,2,30},//otomobil	
	{66*3.75,48*3.75,0,1,1,8,2,34},//otomobil
	{72*3.75,48*3.75,0,1,1,8,2,37},//otomobil	
	{74*3.75,48*3.75,0,1,1,8,2,38},//otomobil	
	{82*3.75,48*3.75,4,1,1,8,2,42},//kamyonet
	{86*3.75,48*3.75,0,1,1,8,2,44},//otomobil	
	{92*3.75,48*3.75,0,1,1,8,2,47},//otomobil
	{98*3.75,48*3.75,0,1,1,8,2,50},//otomobil
	{104*3.75,48*3.75,0,1,1,8,2,53},//otomobil	
	{110*3.75,48*3.75,0,1,1,8,2,56},//otomobil	
	{114*3.75,48*3.75,4,1,1,8,2,58},//kamyonet
	{120*3.75,48*3.75,0,1,1,8,2,61},//otomobil	
	{124*3.75,48*3.75,0,1,1,8,2,63},//otomobil
	{130*3.75,48*3.75,0,1,1,8,2,66},//otomobil	
	{142*3.75,48*3.75,0,1,1,8,2,72},//otomobil	
	{146*3.75,48*3.75,4,1,1,8,2,74},//kamyonet
	{150*3.75,48*3.75,0,1,1,8,2,76},//otomobil	
	{154*3.75,48*3.75,0,1,1,8,2,78},//otomobil
	{158*3.75,48*3.75,0,1,1,8,2,80},//otomobil	
	{162*3.75,48*3.75,0,1,1,8,2,82},//otomobil	
	{166*3.75,48*3.75,4,1,1,8,2,84},//kamyonet
	{170*3.75,48*3.75,0,1,1,8,2,86},//otomobil	
	{174*3.75,48*3.75,0,1,1,8,2,88},//otomobil

	//serit1(týr ve kamyonlar daha yoðun olacak)
	{0*3.75,47*3.75,2,1,1,8,1,1},//kamyon
	{6*3.75,47*3.75,1,1,1,8,1,4},//týr---->deðiþti otomobil
	{12*3.75,47*3.75,4,1,1,8,1,7},//kamyonet
	{16*3.75,47*3.75,4,1,1,8,1,9},//kamyonet
	{20*3.75,47*3.75,1,1,1,8,1,11},//týr---->deðiþti kamyon
	{26*3.75,47*3.75,0,1,1,8,1,14},//otomobil
	{30*3.75,47*3.75,2,1,1,8,1,16},//kamyon
	{34*3.75,47*3.75,2,1,1,8,1,18},//kamyon
	{38*3.75,47*3.75,1,1,1,8,1,20},//týr---->deðiþti kamyon
	{44*3.75,47*3.75,4,1,1,8,1,23},//kamyonet
	{48*3.75,47*3.75,4,1,1,8,1,25},//kamyonet
	{54*3.75,47*3.75,4,1,1,8,1,28},//kamyonet
	{58*3.75,47*3.75,1,1,1,8,1,30},//týr---->deðiþti kamyon
	{64*3.75,47*3.75,0,1,1,8,1,33},//otomobil
	{68*3.75,47*3.75,4,1,1,8,1,35},//kamyonet
	{72*3.75,47*3.75,2,1,1,8,1,37},//kamyon
	{76*3.75,47*3.75,4,1,1,8,1,39},//kamyonet
	{80*3.75,47*3.75,1,1,1,8,1,41},//týr----->deðiþti kamyon
	{86*3.75,47*3.75,0,1,1,8,1,44},//otomobil
	{90*3.75,47*3.75,4,1,1,8,1,46},//kamyonet
	{94*3.75,47*3.75,0,1,1,8,1,48},//otomobil
	{98*3.75,47*3.75,2,1,1,8,1,50},//kamyon
	{100*3.75,47*3.75,2,1,1,8,1,51},//kamyon
	{104*3.75,47*3.75,1,1,1,8,1,53},//týr--------->deðiþti kamyon
	{110*3.75,47*3.75,4,1,1,8,1,56},//kamyonet
	{114*3.75,47*3.75,4,1,1,8,1,58},//kamyonet
	{118*3.75,47*3.75,4,1,1,8,1,60},//kamyonet
	{122*3.75,47*3.75,4,1,1,8,1,62},//kamyonet
	{124*3.75,47*3.75,0,1,1,8,1,63},//otomobil
	{126*3.75,47*3.75,2,1,1,8,1,64},//kamyon
	{128*3.75,47*3.75,0,1,1,8,1,65},//otomobil
	{130*3.75,47*3.75,2,1,1,8,1,66},//kamyon
	{132*3.75,47*3.75,1,1,1,8,1,67},//týr--------->deðiþti kamyon
	{148*3.75,47*3.75,2,1,1,8,1,75},//kamyon
	{154*3.75,47*3.75,2,1,1,8,1,78},//kamyon
	{164*3.75,47*3.75,0,1,1,8,1,83},//otomobil
	{170*3.75,47*3.75,2,1,1,8,1,86},//kamyon

	////YOL9-------------------------------------------->4 tane
	//serit0---->yon3
	{142*3.75,40*3.75,0,1,3,9,0,18},//otomobil
	{142*3.75,36*3.75,2,1,3,9,0,16},//kamyon
	{142*3.75,28*3.75,0,1,3,9,0,12},//otomobil
	{142*3.75,14*3.75,4,1,3,9,0,5},//kamyonet
	
////YOL10---------------------------------------->32-9 tane
	//serit0---->yon3
	{141*3.75,6*3.75,0,1,3,10,0,1},//otomobil
	{141*3.75,18*3.75,0,1,3,10,0,7},
	{141*3.75,26*3.75,0,1,3,10,0,11},
	{141*3.75,38*3.75,0,1,3,10,0,17},
	{141*3.75,42*3.75,0,1,3,10,0,19},
	{141*3.75,54*3.75,0,1,3,10,0,25},
	{141*3.75,58*3.75,0,1,3,10,0,27},
	{141*3.75,66*3.75,0,1,3,10,0,31},
	{141*3.75,72*3.75,0,1,3,10,0,34},
	{141*3.75,74*3.75,0,1,3,10,0,35},
	{141*3.75,82*3.75,0,1,3,10,0,39},
	{141*3.75,86*3.75,0,1,3,10,0,41},
	////serit1
	{138*3.75,12*3.75,0,1,4,10,1,3},//otomobil
	{138*3.75,16*3.75,0,1,4,10,1,5},
	{138*3.75,20*3.75,0,1,4,10,1,7},
	{138*3.75,24*3.75,0,1,4,10,1,9},
	{138*3.75,28*3.75,0,1,4,10,1,11},
	{138*3.75,32*3.75,0,1,4,10,1,13},
	
	{138*3.75,50*3.75,0,1,4,10,1,22},
	{138*3.75,54*3.75,0,1,4,10,1,24},
	
	{138*3.75,68*3.75,0,1,4,10,1,31},
	
	{138*3.75,84*3.75,0,1,4,10,1,39},
	{138*3.75,88*3.75,0,1,4,10,1,41},
	
};
/////////////////////////////
//menü için gerekli deðiþkenler
bool hucreToggle=false;
bool animate=false;
// mouse controls
int mouse_old_x, mouse_old_y;
int mouse_buttons = 0;

/////////////////////////////
void keyboard(unsigned char key, int x, int y);
void mouse(int button, int state, int x, int y);
/////////////////////////////

GLint elapsedTime=0;
int sim_counter=0;
///////////////////////////////////////////////////////

GLint TrafficLight[4];
float LightColor[3][3]={{1.f, 0.f, 0.f}, {1.f, 1.0f, 0.f}, {0.f, 1.f, 0.f}};

///////////////////////////////////////////////////////
void SetupRC()
     {
         glClearColor(1.f, 1.f, 1.0f, 1.f );//arka plan rengi seçiliyor.
     }

void ChangeSize(int w, int h)
    {
         GLfloat nRange = 345.f; 
	// Prevent a divide by zero 
	if(h == 0) 
		h = 1; 
	// Set Viewport to window dimensions 
	glViewport(0, 0, w,h);
	// Reset projection matrix stack 
	glMatrixMode(GL_PROJECTION); 
	glLoadIdentity(); 
	// Establish clipping volume (left, right, bottom, top, near, far) 
	if (w <= h) 
		glOrtho (0, nRange, -nRange*h/w, 0, -nRange, nRange); 
	else glOrtho (0, nRange*w/h, 0, nRange, -nRange, nRange); 
	// Reset Model view matrix stack 
	glMatrixMode(GL_MODELVIEW); 
	glLoadIdentity();
    }


void TL_Time_Depend()
{
	//0:kýrmýzý, 1:sarý, 2:yeþil
	elapsedTime++;
	if(elapsedTime % 90>0 && elapsedTime % 90 <= 40)
	{
		TrafficLight[0]= 2;
		TrafficLight[1]= 0;
		TrafficLight[2]= 2;
		TrafficLight[3]= 0;
	}
	else if(elapsedTime % 90>40 && elapsedTime % 90 <= 45)
	{
		TrafficLight[0]= 1;
		TrafficLight[1]= 1;
		TrafficLight[2]= 1;
		TrafficLight[3]= 1;
	}
	else if(elapsedTime % 90>45 && elapsedTime % 90 <= 85)
	{
		TrafficLight[0]= 0;
		TrafficLight[1]= 2;
		TrafficLight[2]= 0;
		TrafficLight[3]= 2;
	}
	else if(elapsedTime % 90>85 && elapsedTime % 90 <= 90)
	{
		TrafficLight[0]= 1;
		TrafficLight[1]= 1;
		TrafficLight[2]= 1;
		TrafficLight[3]= 1;
	}

	if(elapsedTime%300 ==0) //5dk
		animate=!animate;
}

int minimum(int x,int y)
{
	if(x<y)
		return x;
	return y;
}

int maximum(int x,int y)
{
	if(x>y)
		return x;
	return y;
}
void mainMenu(int i)
{
    keyboard((unsigned char) i, 0, 0);
}

void initMenus()
{
    glutCreateMenu(mainMenu);
    glutAddMenuEntry("Hücreler[H]", 'h');
    glutAddMenuEntry("Duraklat/Devam [D]", 'd');
    glutAddMenuEntry("Çýkýþ (Q)", 'q');
    glutAttachMenu(GLUT_RIGHT_BUTTON);
}

void keyboard(unsigned char key, int /*x*/, int /*y*/)
{
    switch (key)
    {
        case ('q') :
            
            exit(EXIT_SUCCESS);


        case 'd':
            animate = !animate;
            break;

        case 'h':
			hucreToggle = !hucreToggle;
            break;

        
    }

   
}

////////////////////////////////////////////////////////////////////////////////
//! Mouse event handlers
////////////////////////////////////////////////////////////////////////////////
void mouse(int button, int state, int x, int y)
{
    if (state == GLUT_DOWN)
    {
        mouse_buttons |= 1<<button;
    }
    else if (state == GLUT_UP)
    {
        mouse_buttons = 0;
    }

    mouse_old_x = x;
    mouse_old_y = y;
}

